# Pandas - GroupBy

In [1]:
import numpy as np
import pandas as pd

In [3]:
data = {
    'Class' : ['K18', 'K18', 'K19', 'K19', 'K20', 'K20'],
    'Students': ['Trinhdvt', 'NghiaPm', 'KhanhLink', 'AiLink', 'Unknown', 'HotGirl'],
    'Point': [9.0, 8.0, 9.0, 9.9, 2.3, 3.4]
}
df = pd.DataFrame(data)

In [4]:
df

  Class   Students  Point
0   K18   Trinhdvt    9.0
1   K18    NghiaPm    8.0
2   K19  KhanhLink    9.0
3   K19     AiLink    9.9
4   K20    Unknown    2.3
5   K20    HotGirl    3.4

In [7]:
groupClass = df.groupby('Class')

> #### Mean method work only with numeric columns

In [8]:
groupClass.mean()

       Point
Class
K18     8.50
K19     9.45
K20     2.85

In [9]:
groupClass.count()

       Students  Point
Class
K18           2      2
K19           2      2
K20           2      2

In [12]:
groupClass.sum()

       Point
Class
K18     17.0
K19     18.9
K20      5.7

In [15]:
groupClass.describe().transpose()

Class             K18       K19       K20
Point count  2.000000  2.000000  2.000000
      mean   8.500000  9.450000  2.850000
      std    0.707107  0.636396  0.777817
      min    8.000000  9.000000  2.300000
      25%    8.250000  9.225000  2.575000
      50%    8.500000  9.450000  2.850000
      75%    8.750000  9.675000  3.125000
      max    9.000000  9.900000  3.400000